Tekla Open API Reference for Tekla Structures 2025
Task Properties
The Task type exposes the following members.
Properties
Name | Description
ActualEndDate
 The actual end date of the task.
ActualStartDate
 The actual start date of the task.
ActualWorkAmount
 The amount of work already used for the task.
Completeness
 The percentage of the completeness of the task on the scale from 0 to 100.
Critical
 The criticality of the task.
Description
 A short textual description of the task.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
Local
 The locality indicates if the task was created in Tekla Structures and Task Manager or imported.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 The name of the task.
PlannedEndDate
 The planned end date of the task.
PlannedStartDate
 The planned start date of the task.
PlannedWorkAmount
 The amount of work planned to be used for the task.
Scenario
 The scenario which the task belongs to.
Url
 A link to material or data related to the task. The link can be a hyperlink or a file system link.
Top
See Also
Reference
Task Class
Tekla.Structures.Model Namespace